posts/2020-08-11-emacs-for-everyone.tex
% Created 2020-08-12 Wed 23:31
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\author{Thanawat Techaumnuaiwit}
\date{\textit{<2020-08-11 Tue>}}
\title{Emacs for Everyday People.}
\hypersetup{
 pdfauthor={Thanawat Techaumnuaiwit},
 pdftitle={Emacs for Everyday People.},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
---
title: Slides for Emacs for Everyday People.
description: A video explaining why someone would want to use Emacs for writing!
---
\section{Title Slide}
\label{sec:org397e900}
\textbf{Emacs for Everyone}

In this video I will cover:
\begin{enumerate}
\item What is Emacs?
\item Why use Emacs over other software?
\end{enumerate}
\section{Slide: Quote}
\label{sec:org07f84c0}
\textbf{Quote}

``You do not rise to the level of your goals. You fall to the level of your systems'' - James Clear, \emph{Atomic Habits}
\section{Slide: What is Emacs}
\label{sec:orgdf63e7e}
\textbf{What is Emacs}

\begin{itemize}
\item Emacs is a ``Lisp Interpreter''!
\item The main feature of Emacs is text-editing
\item People  are able to write code to
create \textbf{packages}, adding a lot of
functionality to Emacs!
\item \textbf{You don't need to program to use Emacs}
\end{itemize}
\section{Slide: Why Emacs?}
\label{sec:orgd0276e3}
\textbf{Why Emacs?}

\begin{enumerate}
\item Because Emacs is, in my opinion, a better system for writing than say, Microsoft Word
\begin{itemize}
\item That is, if you know how to use it!
\end{itemize}
\item Because it is free!
\begin{itemize}
\item Free as in Freedom
\item Free as in Monetary
\item Free as in Free Time! (*)
\begin{itemize}
\item There's an upfront cost of time
\item But in the long run you save time.
\end{itemize}
\end{itemize}
\end{enumerate}
\section{Slide: Editing Styles}
\label{sec:orgb1c53fd}
\textbf{Editing Styles}

There are two primary editing styles that allows you to write text on a computer faster.
These are:
\subsection{Vim}
\label{sec:orga440c5c}
Vim focuses on \textbf{Modal} editing. It's main philosophy is that most of the time
when writing text, you are actually \textbf{editing} rather than writing. Vim makes
editing a lot easier by splitting actions into different \textbf{modes}. These modes are:
\begin{enumerate}
\item Normal - the mode for describing actions to text
\item Insert - the mode for inserting text
\item Visual - the mode for selecting text
\end{enumerate}
\subsection{Emacs}
\label{sec:orgab4a264}
Emacs, the other hand, focuses on \textbf{Macros}, predefined actions that activates
when you press a certain sequence of keys. For example \texttt{C-n} allows me to move
down a line(without the arrow keys), and \texttt{C-p} allows me to move up one line.
This is useful because you are in one state all the time and it doesn't break
your editing flow. Binding your \texttt{Ctrl} key to \texttt{Caps-lock} makes the Emacs
bindings more ergonomic.
\section{Slide: What else can you do with Emacs?}
\label{sec:orgfc27307}
\textbf{What else can you do with Emacs?}

Most of my computer-related tasks are in Emacs! I use Emacs for:
\begin{enumerate}
\item Todo Lists - Basically manages my life
\item Writing Papers/Presentations
\item Writing Code
\item RSS reader(for blogs/youtube-videos)
\item Reading/Sending Emails
\item And much more!
\end{enumerate}
\section{Closing}
\label{sec:orga763c8c}
\textbf{Closing}

In the following videos, I plan to show you a lot of what you can do with Emacs, primarily
\subsection{More information:}
\label{sec:org0382cf6}
\begin{itemize}
\item Learn more about \href{https://www.gnu.org/software/emacs/}{Emacs}.
\item Read the \href{https://github.com/hlissner/doom-emacs/blob/develop/docs/getting\_started.org}{Getting started with Doom-Emacs} guide
\item Read the \href{https://www.gnu.org/software/emacs/manual/html\_node/emacs/index.html}{Emacs manual} and the \href{https://orgmode.org/manual/index.html}{org-mode manual}. Personally never read it.. :D
\begin{itemize}
\item You can also check out the manual within Emacs by pressing \texttt{SPC h i} and clicking on
the topics that you want to know more about(or use your vim-keys(you can go
to the next page of a manual by doing \texttt{C-j} or \texttt{C-k}, \texttt{C} stands for Control,
\texttt{M} stands for ``meta'' or ``alt'')
\end{itemize}
\item Before installing Doom Emacs(or after), check out my Overview of Emacs and my Evil-tutor
walkthrough on why you should even bother with it!
\end{itemize}
\end{document}
